update arch diagram
